Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/employment/employment_rights_and_conditions/hours_of_work/working_week.html.txt.tmx
Source language: en
Languages: pl

source: The Organisation of Working Time Act 1997 states that the maximum average working week for many employees cannot exceed 48 hours
pl: Ustawa o organizacji czasu pracy (Organisation and Working Time Act) z 1997 r

source: This does not mean that a working week can never exceed 48 hours, it is the average that is important
pl: stanowi, że maksymalny średni tygodniowy wymiar czasu pracy dla wielu pracowników nie może przekraczać 48 godzin

source: The average may be calculated in one of the following ways:
pl: Średni czas pracy można obliczać w jeden z podanych poniżej sposobów:

source: • Over 4 months for most employees
pl: • w 4-miesięcznym okresie rozliczeniowym dla większości pracowników

source: • Over 6 months for employees working in the security industry, hospitals, prisons, gas/electricity, airport/docks, agriculture and employees in businesses which have peak periods at certain times of the year such as tourism
pl: • w 6-miesięcznym okresie rozliczeniowym w przypadku osób pracujących w sektorze bezpieczeństwa, w szpitalach, zakładach karnych, gazowniach/ elektrowniach, na lotniskach/w dokach, w rolnictwie oraz w przypadku pracowników przedsiębiorstw, w których występuje spiętrzenie pracy w pewnych porach roku, np

source: • over 12 months where there has been an agreement between the employer and the employees to this effect
pl: • w 12-miesięcznym okresie rozliczeniowym w sytuacjach, kiedy pracodawca zawarł z pracownikami porozumienie w tej sprawie

source: The agreement between employer and employees must be approved by the Labour Court
pl: Takie porozumienie między pracodawcą a pracownikami musi być zatwierdzone przez Sąd Pracy

source: The calculation of 48 hours does not include annual leave, sick leave or maternity/adoptive/parental leave
pl: Przy obliczaniu 48 godzin nie uwzględnia się urlopu wypoczynkowego, zwolnienia lekarskiego ani urlopu macierzyńskiego/adopcyjnego/wychowawczego

source: The legislation also lays down rules for night workers, minimum breaks and rest periods
pl: Prawo określa też zasady dotyczące pracowników nocnych, minimalnych przerw podczas pracy i okresów odpoczynku

source: There are also special provisions in relation to Sunday working – see below
pl: Są również specjalne postanowienia dotyczące pracy w niedzielę – patrz poniżej

source: The provisions of the Organisation of Working Time Act 1997 on working time and rest periods do not apply to all employees
pl: Postanowienia ustawy o organizacji czasu pracy z 1997 r. dotyczące wymiaru czasu pracy i okresów odpoczynku nie odnoszą się wszystkich zatrudnionych

source: They do not apply to the Gardaí, Defence Forces, employees who control their own working hours or family employees on farms or in private homes
pl: Nie dotyczą one policji (Gardaí), Sił Obronnych, pracowników, którzy sami regulują swój czas pracy oraz członków rodzin pracujących w gospodarstwach rolnych lub prywatnych domach

source: The working hours of young people under the age of 18 are regulated by the Protection of Young Persons (Employment) Act 1996
pl: Czas pracy młodocianych pracowników poniżej 18 roku życia reguluje ustawa o ochronie młodocianych pracowników (Protection of Young Persons (Employment) Act) z 1996 r

source: There are separate regulations governing the working time of trainee doctors (SI 494/2004), employees working in mobile road transport activities (SI 36/2012) and employees working at sea
pl: Odrębne przepisy regulują czas pracy lekarzy w trakcie szkolenia (SI 494 z 2004 r.) oraz osób pracujących na morzu

source: Employees in certain categories of civil protection services (SI 52/1998) are currently exempt from provisions on maximum average working week and statutory rest breaks/periods
pl: W stosunku do pracowników zatrudnionych w transporcie (SI 20 z 1998 r.) oraz w niektórych kategoriach cywilnych służb ochrony (SI 52 z 1998 r.) nie obowiązują obecnie przepisy dotyczące maksymalnego średniego tygodniowego czasu pracy i ustawowych okresów odpoczynku/przerw

source: Provision of information about working hours
pl: Udostępnienie informacji na temat godzin pracy

source: For many employees the hours of work are specified, for example, in their contract of employment or in an Employment Regulation Order or Registered Employment AGreement
pl: W przypadku wielu pracowników godziny pracy są szczegółowo określone, na przykład, w umowie o pracy bądź regulacjach noszących nazwę ERO (Regulacje dot

source: If the hours of work are not specified, under Section 17 of the Act, the employer must notify the employee of the starting and finishing times at least 24 hours before the first day or the day of each week the employee is required to work
pl: Zatrudnienia). Jeśli liczba godzin pracy nie jest zdefiniowana, zgodnie z Częścią 17 Ustawy, pracodawca musi powiadomić pracownika o godzinach rozpoczęcia i zakończenia pracy co najmniej 24 godziny przed pierwszym dniem pracy lub w pewien dzień każdego tygodnia, kiedy pracownik ma się stawić w pracy

source: The employer can do this by putting up a notice in a conspicuous place in the employee's workplace on a day when the employee is working
pl: Pracodawca może tego dokonać wywieszając powiadomienie w widocznym miejscu w dniu, w którym pracodawca jest w miejscu pracy

source: If the employee is required to work additional hours the 24 hours' notice must be given in the same way
pl: Jeśli wymaga się od pracodawcy zjawienia się w pracy na dodatkowe godziny, 24 godziny wcześniej należy umieścić ogłoszenie

source: However, in unforeseen circumstances such as another employee off work sick, the employer can ask the employee to work at less than 24 hours' notice
pl: Jednak w nieprzewidzianych sytuacjach takich jak nagła choroba pracownika, pracodawca może poprosić pracownika o zjawienie się w pracy informując go o tym wcześniej niż 24 godziny

source: If you do Sunday work your entitlement to extra pay may be agreed between you and your employer
pl: W przypadku świadczenia pracy w niedziele pracownik może uzgodnić z pracodawcą prawo do dodatkowego wynagrodzenia

source: Under the Organisation of Working Time Act, if there is no agreement about your pay, your employer must give you one or more of the following for Sunday working:
pl: Zgodnie z ustawą o organizacji czasu pracy, w przypadku braku uzgodnienia w sprawie wynagrodzenia pracownika pracodawca musi zapewnić mu w zamian za pracę w niedziele co najmniej jedną z poniższych form rekompensaty:

source: • Reasonable paid time off work
pl: • odpowiedni płatny czas wolny

source: What is reasonable depends on all the circumstances
pl: Co uważa się za odpowiednie zależy od wszystkich okoliczności

source: It is a matter for negotiation between you and your employer and, where applicable, your trade union
pl: Jest to sprawa do negocjacji pomiędzy pracownikiem a pracodawcą oraz, w stosownych przypadkach, ze związkiem zawodowym

source: Some guidance may be obtained by referring, where possible, to an agreement applying to comparable employees elsewhere in similar employment
pl: Pewne wskazówki można uzyskać kierując się, tam gdzie jest to możliwe, porozumieniem dotyczącym porównywalnych pracowników zatrudnionych w podobnym charakterze w innych miejscach pracy

source: The Workplace Relations Commission has a Code of Practice for Sunday working in the Retail Trade
pl: Komisja ds. stosunków pracowniczych (Labour Relations Commission) opublikowała kodeks praktyki dotyczący pracy w niedzielę w handlu detalicznym (pdf)

source: Overtime is work done outside normal working hours.There is no statutory obligation on employers to pay employees for work completed in overtime
pl: Praca w godzinach nadliczbowych to praca wykonywana poza normalnym czasem pracy. Pracodawcy w Irlandii nie są prawnie zobowiązani do wypłacania pracownikom wyższych stawek, np

source: Many employers pay employees higher rates of pay for overtime
pl: podwójnych, za pracę wykonywaną w godzinach nadliczbowych

source: Your contract of employment should state if you are required to work overtime and the rates of pay if you are to be paid for it
pl: Pracownik musi jednak za pracę w godzinach nadliczbowych otrzymywać co najmniej swoją zwykłą stawkę godzinową

source: Certain sectors of employment were covered by Employment Regulation Orders and Registered Employment Agreements and may have higher rates of pay for overtime
pl: Niektóre sektory zatrudnienia zostały objęte przepisami ERO (Regulacje dot. Zatrudnienia) i REA (Zarejestrowane Umowy dot. Zatrudnienia) i mogą wiązać się z wyższymi opłatami za nadgodziny

source: Workers with no fixed place of work
pl: Zgodnie z rozporządzeniami z 2001 r

source: Under the Organisation of Working Time (Records) (Prescribed Form and Exemptions) Regulations 2001, your employer is required to keep detailed records of your working hours
pl: w sprawie organizacji czasu pracy (dokumentacja) (obowiązujący formularz i wyłączenia) (Organisation of Working Time (Records) (Prescribed Form and Exemptions) Regulations 2001), pracodawca zobowiązany jest do prowadzenia szczegółowej dokumentacji czasu pracy pracownika

source: You should refer disputes under the Organisation of Working Time Act 1997 within 6 months of the dispute or complaint occurring
pl: Skargi powinny być przedstawione zgodnie z zapisami Ustawy o Organizacji Czasu Pracy z 1997 roku korzystając z nowego, pojedynczego formularza skarg(pdf)

source: You must use the online complaint form available on workplacerelations.ie
pl: Należy złożyć skargę w ciągu 6 miesięcy od daty zaistnienia dysputy

source: However this time limit may be extended for up to 12 months if there was reasonable cause for not bringing the complaint within the first 6 months
pl: Jednakże limit czasu może zostać przedłużony do 12 miesięcy jeśli miał miejsce powód, dla którego nie było możliwe przedstawienie skargi w ciągu 6 miesięcy

source: Further information on working hours and your employment rights is available from the Workplace Relations Commission's Information and Customer Service – see 'Where to apply' below
pl: Dalsze informacje można uzyskać w Biurze Obsługi ds. Relacji w Miejscu Pracy – poniżej należy zapoznać się z sekcją “Gdzie składać prośbę”
